Reading And Writing Data in Text Format (link with Google Colab)
[![Open In Colab](https://colab.research.google.com/assets/colab-badge.svg)](https://colab.research.google.com/github/googlecolab/colabtools/blob/master/notebooks/colab-github-demo.ipynb)

In [1]:
import pandas as pd
import numpy as np

In [2]:
import tensorflow as tf

In [9]:
# !cat   /content/sample_data/california_housing_test.csv

In [10]:
pd.read_csv("/content/sample_data/california_housing_test.csv").head(3)

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0

[3 rows x 9 columns]

In [8]:
pd.read_csv("/content/sample_data/california_housing_test.csv",header= None) # by default it's none

                0          1  ...              7                   8
0       longitude   latitude  ...  median_income  median_house_value
1     -122.050000  37.370000  ...       6.608500       344700.000000
2     -118.300000  34.260000  ...       3.599000       176500.000000
3     -117.810000  33.780000  ...       5.793400       270500.000000
4     -118.360000  33.820000  ...       6.135900       330000.000000
...           ...        ...  ...            ...                 ...
2996  -119.860000  34.420000  ...       1.179000       225000.000000
2997  -118.140000  34.060000  ...       3.390600       237200.000000
2998  -119.700000  36.300000  ...       2.289500        62000.000000
2999  -117.120000  34.100000  ...       3.270800       162500.000000
3000  -119.630000  34.420000  ...       8.560800       500001.000000

[3001 rows x 9 columns]